import unittest

from app.models import KFK, AnalysisInfo, Utils
from src.settings import get_settings


settings = get_settings()

class TestUtils(unittest.TestCase):
    def test_generate(self):
        Utils.generate_kfk('C4ke/2022-02-05/C4ke-oku002211-20220205_165555.kif')


class TestKFK(unittest.TestCase):
    def test_generate_xml_str(self):
        analysis_info_dict_list = [
            {'move': '   1 ▲２六歩(27)', 'score': 85, 'pv': '▲７六歩(77)△３二金(41)▲２六歩(27)△８四歩(83)▲７八金(69)△８五歩(84)▲７七角(88)△３四歩(33)▲６八銀(79)△７七角成(22)▲７七銀(68)△２二銀(31)▲３八銀(39)△７四歩(73)▲４六歩(47)△３三銀(22)▲４七銀(38)△６二銀(71)▲１六歩(17)△９四歩(93)▲６八玉(59)△４二玉(51)▲５六銀(47)△１四歩(13)'},
            {'move': '   2 △３四歩(33)', 'score': -74, 'pv': '△８四歩(83)▲７六歩(77)△８五歩(84)▲７七角(88)△３四歩(33)▲６八銀(79)△７七角成(22)▲７七銀(68)△２二銀(31)▲７八金(69)△３三銀(22)▲３八銀(39)△７四歩(73)▲６八玉(59)△７三桂(81)▲４六歩(47)△６二銀(71)▲４七銀(38)△６四歩(63)▲２五歩(26)△４二玉(51)▲３六歩(37)△６五桂(73)'},
            {'move': '   3 ▲２五歩(26)', 'score': 82, 'pv': '▲７六歩(77)'},
            {'move': '   4 △３三角(22)', 'score': -46, 'pv': '△３三角(22)▲７六歩(77)△２二銀(31)▲３八銀(39)△８四歩(83)▲３三角成(88)△３三銀(22)▲８八銀(79)△６二銀(71)▲３六歩(37)△３二金(41)▲７七銀(88)△６四歩(63)▲４六歩(47)△７四歩(73)▲６八玉(59)△４二玉(51)▲３七桂(29)△７三桂(81)▲７八金(69)△１四歩(13)▲９六歩(97)△４四歩(43)'},
            {'move': '   5 ▲７六歩(77)', 'score': 60, 'pv': '▲７六歩(77)△２二銀(31)▲６八玉(59)△８四歩(83)▲３三角成(88)△３三銀(22)▲３八銀(39)△７四歩(73)▲８八銀(79)△３二金(41)▲４六歩(47)△７三桂(81)▲３六歩(37)△５五角打▲７八金(69)△４六角(55)▲３七桂(29)△６四角(46)▲７七銀(88)△５二金(61)▲５八金(49)△８五歩(84)▲６六歩(67)'},
            {'move': '   6 △４四歩(43)', 'score': -45, 'pv': '△４二銀(31)▲３八銀(39)△８四歩(83)▲３三角成(88)△３三銀(42)▲８八銀(79)△８五歩(84)▲７八金(69)△６二銀(71)▲３六歩(37)△３二金(41)▲４六歩(47)△４四歩(43)▲７七銀(88)△６四歩(63)▲６八玉(59)△６三銀(62)▲３七桂(29)△９四歩(93)▲９六歩(97)△５四銀(63)▲２九飛(28)△４二玉(51)▲１六歩(17)'},
            {'move': '   7 ▲４八銀(39)', 'score': 108, 'pv': '▲４八銀(39)'},
            {'move': '   8 △４二銀(31)', 'score': -93, 'pv': '△８四歩(83)▲６八玉(59)△４二銀(31)▲３六歩(37)△４三銀(42)▲３七銀(48)△８五歩(84)▲７七角(88)△３二金(41)▲７八銀(79)△５二金(61)▲５八金(49)△７四歩(73)▲３五歩(36)△３五歩(34)▲４六銀(37)△７五歩(74)▲７五歩(76)△４五歩(44)▲３五銀(46)△７七角成(33)▲７七銀(78)△７六歩打▲７六銀(77)'},
            {'move': '   9 ▲６八玉(59)', 'score': 107, 'pv': '▲３六歩(37)△８四歩(83)▲６八玉(59)△３二金(41)▲７八銀(79)△８五歩(84)▲７七角(88)△４三銀(42)▲３七銀(48)△５二金(61)▲５八金(49)△６二銀(71)▲３五歩(36)△３五歩(34)▲２六銀(37)△３四銀(43)▲３八飛(28)△４三金(52)▲３五銀(26)△３五銀(34)▲３五飛(38)△３四歩打▲３六飛(35)△７四歩(73)▲３七桂(29)△７三桂(81)▲７九玉(68)△５四歩(53)▲４六歩(47)△３五銀打▲１六飛(36)△１四歩(13)▲４五歩(46)△４五歩(44)▲４五桂(37)'},
            {'move': '  10 △５四歩(53)', 'score': -78, 'pv': '△８四歩(83)▲７七角(88)△８五歩(84)▲３六歩(37)△４三銀(42)▲７八銀(79)△３二金(41)▲５八金(49)△５二金(61)▲３七銀(48)△６二銀(71)▲３五歩(36)△３五歩(34)▲２六銀(37)△３四銀(43)▲３八飛(28)△４三金(52)▲３五銀(26)△３五銀(34)▲３五飛(38)△３四歩打▲３六飛(35)△７四歩(73)▲４六歩(47)△７三桂(81)▲４五歩(46)△６五桂(73)▲５五角(77)△６四銀打▲６六角(55)△４五歩(44)'}
        ]
        kfk = KFK()
        for analysis_info_dict in analysis_info_dict_list:
            analysis_info = AnalysisInfo(analysis_info_dict)
            print(analysis_info)
            kfk.game_analysis.analysis_info_list.append(analysis_info)

        print('__dict__:', kfk.game_analysis.__dict__)
        
        